#ifndef WORDFUNC_H
#define WORDFUNC_H


//******************************************************************************
//**** 获得指定词库中的单词数目
int GetWordNum(u8 cikui);

//******************************************************************************
//**** 判断两个字符串的优先权，返回-1,0,1
int stropt(char *word1, char *word2);

//******************************************************************************
//**** 给定一个字符串，查找与之最为相近的单词(采用2分法);
int GetNearWordIndex(u8 cikui, char* wordstr);	

//******************************************************************************
//**** 得到词库数目
int GetCikuNum();	

//******************************************************************************
//**** 得到词库文件的头数据结构
void GetSoftHead();

//******************************************************************************
//**** 得到某词库第index个单词的数据
int GetWord(u8 cikui, u16 index, char* word, char* yinbiao, char* trans);	

//******************************************************************************
//**** 返回某词典的某位置单词是否为重点单词
u8 getvip(u16 ciku, u16 wordi);

//******************************************************************************
//**** 设置某词典的某位置单词为重点单词
void setvip(u16 ciku, u16 wordi,u8 isvip);

//******************************************************************************
//**** 得到下一个单词序号
int getnextword(u8 ciku, u16 wordi,u8 fanwei);

//******************************************************************************
//**** 得到前一个单词序号
int getpreword(u8 ciku, u16 wordi,u8 fanwei);


#endif
