#ifndef WORDMENU_H
#define WORDMENU_H

#define MENU_ITEM_SHOW_COUNT	6
//16 Color Tile Graphics, Tiles Used: 19
                  

const char *mnu_select_function[4] = {
	"学习模式",
	"背记模式-英译汉",
	"背记模式-汉译英",
	"英汉词典",
	//"使用帮助"
};

const char *mnu_select_ciku[4] = {
	"大学英语四级",
	"大学英语六级",
	"托福英语水平",
	"GRE英语水平"
};
const char *mnu_run_option[6] = {
	"继续学习",
	"保存单词学习进度",
	"引导单词学习进度",
	"删除所有学习进度",
	"取消本词库重点",
	"结束并返回菜单",
};

const char *mnu_select_fanwei[28] = {
	"完整单词表",
	"用户自定义重点单词",
	"A - 打头单词表",
	"B - 打头单词表",
	"C - 打头单词表",
	"D - 打头单词表",
	"E - 打头单词表",
	"F - 打头单词表",
	"G - 打头单词表",
	"H - 打头单词表",
	"I - 打头单词表",
	"J - 打头单词表",
	"K - 打头单词表",
	"L - 打头单词表",
	"M - 打头单词表",
	"N - 打头单词表",
	"O - 打头单词表",
	"P - 打头单词表",
	"Q - 打头单词表",
	"R - 打头单词表",
	"S - 打头单词表",
	"T - 打头单词表",
	"U - 打头单词表",
	"V - 打头单词表",
	"W - 打头单词表",
	"X - 打头单词表",
	"Y - 打头单词表",
	"Z - 打头单词表"
};

const char *mnu_select_help[4] = {
	"软件介绍",
	"使用方法",
	"版权声明",
	"购买方式",
};
const char *mnu_select_help_data[4] = {
	"AppleWord(苹果单词)是一 个GBA专用单词学习软件。提供单词初学、英汉背诵、汉英背诵，以及英汉词典查询模式。\\用户可以将单词标记为重点，针对性的加强训练。也可在开机后从上次结束的地方继续学习。\\AppleWord收录16420个单词供学习使用， 18200单词供查询使用。",
	"选择选择初学/背诵模式后，再选定一个词库后，进入学习页面后，按下左右箭头或L/R进行前后单词切换。\\遇到不熟悉单词，按下SELECT键标记为重点，随后可以专门背记这些重点单词。\\英汉或汉英背诵模式下，按下A/B分别为显示/隐藏汉语或英文。",
	"EZWord(苹果单词)属于EZGroup所有。您只能通过合法途径获得并使用本软件正式版且仅限个人使用，不得擅自复制、修改、传播本软件全部或部分，特别禁止擅自于互联网上散布本软件正式版，否则将面临严厉的经济和法律制裁。",
	"EZWord(苹果单词)正式版,属于EZLoader的一部分，可以通过www.ezflash.cn下载，购买EZ卡带，参看网站经销商列表",
};

char mnu_tmp_str0[32]={0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
char mnu_tmp_str1[32]={0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
char mnu_tmp_str2[32]={0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
char mnu_tmp_str3[32]={0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
char mnu_tmp_str4[32]={0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
char *mnu_select_words[5] = {
	mnu_tmp_str0,
	mnu_tmp_str1,
	mnu_tmp_str2,
	mnu_tmp_str3,
	mnu_tmp_str4,
};

char mnu_saveload_str0[32]={0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
char mnu_saveload_str1[32]={0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
char mnu_saveload_str2[32]={0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
char mnu_saveload_str3[32]={0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
char mnu_saveload_str4[32]={0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0, 0,0,0,0};
char *mnu_saveload[5] = {
	mnu_saveload_str0,
	mnu_saveload_str1,
	mnu_saveload_str2,
	mnu_saveload_str3,
	mnu_saveload_str4,
};

#endif
